#include<stdio.h>

int main(void)
{

    int  a[4][3]={{1,1,1},{2,2,2},{3,3,3},{4,4,4}};
    int  b[3][4]={{1,1,1,1},{2,2,2,2},{3,3,3,3}};
    int  n[4][4]={0};
    int  i,j,m,h,temp;
//  6, 6, 6, 6
// 12,12,12,12
// 18,18,18,18
// 24,24,24,24

//输入值
	for(i=0;i<=3;i++)
	{
		for(j=0;j<=2;j++)
		{
		printf("a的第%d行,第%d列的值是:",i,j);
		scanf("%d"&a[i][j]);
		}
	}

	for(i=0;i<=3;i++)
	{
		for(j=0;j<=2;j++)
		{
		printf("b的第%d行,第%d列的值是:",i,j);
		scanf("%d"&b[i][j]);
		}
	}


m=0;
temp=0;
//运算过程
//a的行，
	for(i=0;i<=3;i++)
	{
		
		for(h=0;h<=3;h++)
		{
		temp=0;
				//单独写一个j，那么只是矩阵的第一个数，
				//4×3 和3×4的矩阵，第一行乘第一列， 第一行乘第二列，....
				for(j=0;j<=2;j++)
				{
					temp=temp+a[i][j]*b[j][i];
				}

			n[m][h]=temp;
			if (h==3) 
				m++;
		}
	}




//显示 矩阵乘法之后的内容。
for(i=0;i<=3;i++){
for(j=0;j<=3;j++){
printf("%5d",n[i][j]) ;
}
printf("\n");
}


    return 0;
} 
